backend/app/controllers/contacts_controller.rb

    def create
        contact = Contact.create({name: params[:name], email: params[:email], phone: params[:phone], details: params[:details], user: current_user})
---
INSERT INTO "contacts" ("name", "email", "phone", "details", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "wqeqwe"], ["email", "qweqw"], ["phone", "eqwe"], ["details", ""], ["user_id", 7]]