backend/app/controllers/likes_controller.rb

INSERT INTO "likes" ("listing_id", "user_id") VALUES (?, ?)  [["listing_id", "1"], ["user_id", "1"]]
---
    def create
        like = Like.create(like_params)
        like.user = current_user
        like.save()

SELECT "likes".* FROM "likes"
---
    def index
            likes = Like.all

SELECT "likes".* FROM "likes" WHERE "likes"."listing_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["listing_id", "4"], ["user_id", "1"], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 4]]
---
    def delete
        like = Like.find_by( listing_id: params[:id], user_id: current_user.id )
        like.destroy