backend/app/controllers/listing_controller.rb

SELECT "listings".* FROM "listings"
---
    def get_listings
        render json: Listing.all