backend/app/controllers/users_controller.rb

    def login
        user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "geee"], ["LIMIT", 1]]

    def signup
        User.create({
            username: params[:username],
            password: params[:password],
        })
---
INSERT INTO "users" ("username", "password_digest") VALUES (?, ?)  [["username", "2"], ["password_digest", "$2a$12$ZPIrjQ937qfWMU7ir8fTsOYT9HrbFrmfedYlY0Qba5S0yoZphh25e"]]